Revit 2027 API
ControlledApplication.ProgressChanged Event
 Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<ProgressChangedEventArgs> ProgressChanged
Public Event ProgressChanged As EventHandler(Of ProgressChangedEventArgs)
public:
 event EventHandler<ProgressChangedEventArgs^>^ ProgressChanged {
	void add (EventHandler<ProgressChangedEventArgs^>^ value);
	void remove (EventHandler<ProgressChangedEventArgs^>^ value);
}
member ProgressChanged : IEvent<EventHandler<ProgressChangedEventArgs>,
    ProgressChangedEventArgs>
Value
EventHandler<ProgressChangedEventArgs>
Remarks
 Handlers of this event may use the Cancel() method to cancel the operation tracked by the progress bar. Users may not change the document in the handler for this event. Exception ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace